import { PREFIX } from "../../config.js";
import { readMore } from "../../utils/index.js";

export default {
  name: "catalogo",
  description: "Catálogo oficial do ULQUIORRA BOT",
  commands: ["catalogo", "catalog", "precos", "preços"],
  usage: `${PREFIX}catalogo`,

  handle: async ({ sendReply }) => {
    await sendReply(`

╔══════════════════════════════╗
         📦 𝐗𝐈𝐂 • 𝐂𝐀𝐓𝐀𝐋𝐎𝐆𝐎
╚══════════════════════════════╝
${readMore()}
⚠️ 𝐀𝐕𝐈𝐒𝐎

⛓️ 𝐎 𝐗𝐈𝐂 𝐁𝐎𝐓 𝐚𝐢𝐧𝐝𝐚 𝐞𝐬𝐭𝐚́ 𝐞𝐦
𝐝𝐞𝐬𝐞𝐧𝐯𝐨𝐥𝐯𝐢𝐦𝐞𝐧𝐭𝐨.

𝐀𝐨 𝐚𝐝𝐪𝐮𝐢𝐫𝐢𝐫 𝐨 𝐛𝐨𝐭 𝐯𝐨𝐜𝐞̂
𝐚𝐣𝐮𝐝𝐚 𝐝𝐢𝐫𝐞𝐭𝐚𝐦𝐞𝐧𝐭𝐞 𝐧𝐨
𝐜𝐫𝐞𝐬𝐜𝐢𝐦𝐞𝐧𝐭𝐨 𝐝𝐨 𝐩𝐫𝐨𝐣𝐞𝐭𝐨.

━━━━━━━━━━━━━━━━━━━━━━

╭───────────────╮
│  🛒 𝐂𝐀𝐓𝐀𝐋𝐎𝐆𝐎
╰───────────────╯

┏━━━━━━━━━━━━━━━━━━━━━━┓
┃ 📦 𝐏𝐑𝐎𝐃𝐔𝐓𝐎𝐒
┣━━━━━━━━━━━━┳━━━━━━━━━┫
┃ 𝟏 𝐌𝐄̂𝐒       ┃ 💰 𝐑$ 𝟑,𝟎𝟎
┣━━━━━━━━━━━━╋━━━━━━━━━┫
┃ 𝟑 𝐌𝐄𝐒𝐄𝐒   ┃ 💰 𝐑$ 𝟖,𝟎𝟎
┃                    ┃ 🎁 ~𝟏𝟏%
┃                    ┃ 𝐃𝐄𝐒𝐂𝐎𝐍𝐓𝐎
┗━━━━━━━━━━━━┻━━━━━━━━━┛

━━━━━━━━━━━━━━━━━━━━━━

📦 𝐈𝐍𝐂𝐋𝐔𝐈

✅ 𝐀𝐜𝐞𝐬𝐬𝐨 𝐚𝐨 𝐗𝐈𝐂 𝐁𝐎𝐓
✅ 𝐀𝐭𝐮𝐚𝐥𝐢𝐳𝐚𝐜̧𝐨̃𝐞𝐬
✅ 𝐒𝐮𝐩𝐨𝐫𝐭𝐞
✅ 𝐍𝐨𝐯𝐨𝐬 𝐜𝐨𝐦𝐚𝐧𝐝𝐨𝐬

━━━━━━━━━━━━━━━━━━━━━━

💳 𝐂𝐎𝐌𝐎 𝐂𝐎𝐌𝐏𝐑𝐀𝐑

📲 𝐂𝐡𝐚𝐦𝐞 𝐨 𝐝𝐨𝐧𝐨
𝐞 𝐬𝐨𝐥𝐢𝐜𝐢𝐭𝐞 𝐚 𝐚𝐭𝐢𝐯𝐚𝐜̧𝐚̃𝐨.
Wa.me/+553199713-8522
@ez._slv

━━━━━━━━━━━━━━━━━━━━━━

💡 𝐒𝐔𝐆𝐄𝐒𝐓𝐎̃𝐄𝐒

𝐔𝐬𝐞:

${PREFIX}sugestao 𝐬𝐮𝐚 𝐢𝐝𝐞𝐢𝐚

𝐏𝐚𝐫𝐚 𝐧𝐨𝐬 𝐚𝐣𝐮𝐝𝐚𝐫 𝐚
𝐜𝐫𝐞𝐬𝐜𝐞𝐫𝐦𝐨𝐬 𝐨 𝐗𝐈𝐂
𝐣𝐮𝐧𝐭𝐨𝐬.

🖤 𝐒𝐮𝐚 𝐨𝐩𝐢𝐧𝐢𝐚̃𝐨
𝐞́ 𝐦𝐮𝐢𝐭𝐨 𝐢𝐦𝐩𝐨𝐫𝐭𝐚𝐧𝐭𝐞
𝐩𝐚𝐫𝐚 𝐧𝐨́𝐬.

╔══════════════════════╗
      ⚙️ 𝐗𝐈𝐂 • 𝐁𝐎𝐓
╚══════════════════════╝

`);
  },
};