import { PREFIX } from "../../config.js";

export default {
  name: "dono",
  description: "Informações do dono do bot",
  commands: ["dono", "owner", "criador"],
  usage: `${PREFIX}dono`,

  handle: async ({ sendReply }) => {
    const readMore = String.fromCharCode(8206).repeat(4000);

    await sendReply(`${readMore}

╔═══════════════════════════════╗
║        ☠️  𝑿𝑰𝑪 𝑵𝑶𝑫𝑬  ☠️         ║
╚═══════════════════════════════╝

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃        『 𝙊𝙒𝙉𝙀𝙍 𝘼𝙍𝘾𝙃𝙄𝙑𝙀 』
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛

╭─────────────────────
│ 👤 𝙉𝙤𝙢𝙚
│ ➥ 𝑿𝒂𝒑𝒂
├─────────────────────
│ 🎸 𝙋𝙧𝙤𝙟𝙚𝙩𝙤
│ ➥ 𝑿𝒂𝒑𝒂 𝑰𝒏 𝑪𝒉𝒂𝒊𝒏𝒔
├─────────────────────
│ 🤖 𝘽𝙤𝙩
│ ➥ 𝕏𝕀ℂ 𝔹𝕆𝕋
├─────────────────────
│ 📦 𝙑𝙚𝙧𝙨𝙖̃𝙤
│ ➥ v1.0
├─────────────────────
│ 🟢 𝙎𝙩𝙖𝙩𝙪𝙨
│ ➥ ONLINE
├─────────────────────
│ 📞 𝘾𝙤𝙣𝙩𝙖𝙩𝙤
│ ➥ +55 31 99713-8522
├─────────────────────
│ 📷 𝙄𝙣𝙨𝙩𝙖𝙜𝙧𝙖𝙢
│ ➥ @ez._slv
╰─────────────────────

╔══════════════════════╗
║      『 𝙇𝙊𝙂𝙎 』      ║
╚══════════════════════╝

▣ 𝚃𝙷𝙴 𝙴𝚈𝙴 𝚂𝙴𝙴𝚂
▣ 𝚃𝙷𝙴 𝙽𝙾𝙳𝙴 𝚁𝙴𝙼𝙴𝙼𝙱𝙴𝚁𝚂
▣ 𝚃𝙷𝙴 𝙲𝙷𝙰𝙸𝙽𝚂 𝙽𝙴𝚅𝙴𝚁 𝙱𝚁𝙴𝙰𝙺
▣ 𝚃𝙷𝙴 𝙽𝙾𝙳𝙴 𝙸𝚂 𝚂𝚃𝙸𝙻𝙻 𝙰𝙻𝙸𝚅𝙴

━━━━━━━━━━━━━━━━━━━━━━━

⚙️ 𝘾𝙧𝙞𝙖𝙙𝙤𝙧 𝙙𝙤 𝙎𝙞𝙨𝙩𝙚𝙢𝙖
💻 𝘿𝙚𝙨𝙚𝙣𝙫𝙤𝙡𝙫𝙚𝙙𝙤𝙧
🎸 𝙁𝙪𝙣𝙙𝙖𝙙𝙤𝙧 𝙙𝙤 𝙓𝙖𝙥𝙖 𝙄𝙣 𝘾𝙝𝙖𝙞𝙣𝙨
📡 𝙈𝙖𝙞𝙣 𝙉𝙤𝙙𝙚
🧠 𝘼𝙧𝙦𝙪𝙞𝙩𝙚𝙩𝙤 𝙙𝙤 𝙓𝙄𝘾 𝘽𝙊𝙏

━━━━━━━━━━━━━━━━━━━━━━━

╭━━━━━━━━━━━━━━━━━━━━━╮
┃ 𝕏𝕀ℂ://𝕆𝕎ℕ𝔼ℝ_𝔸ℝℂℍ𝕀𝕍𝔼
╰━━━━━━━━━━━━━━━━━━━━━╯

> "𝑻𝒉𝒆 𝒄𝒉𝒂𝒊𝒏𝒔 𝒅𝒐𝒏'𝒕 𝒉𝒐𝒍𝒅 𝒎𝒆.
> 𝑻𝒉𝒆𝒚 𝒂𝒓𝒆 𝒘𝒉𝒂𝒕 𝒌𝒆𝒆𝒑𝒔 𝒎𝒆 𝒂𝒍𝒊𝒗𝒆."

═══════════════════════════════
      ☠️  𝑿𝑰𝑪 𝑩𝑶𝑻  ☠️
═══════════════════════════════

`);
  },
};